Конфигурация/DataProcessors/ТестовоеЗаполнениеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестовоеЗаполнениеДанных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>м</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/ТестовоеЗаполнениеДанных/Ext/ObjectModule.bsl
// =================================================================================
// МОДУЛЬ ОБЪЕКТА: Тестовое заполнение данных
// Объединенная обработка для заполнения всех тестовых данных
// =================================================================================

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеНоменклатуры

Процедура ЗаполнитьНоменклатуру(КоличествоЭлементов, КоличествоГрупп, КоличествоЭлементовВГруппе) Экспорт
	ОчиститьНоменклатуру();
	МассивГрупп = СоздатьГруппыНоменклатуры(КоличествоГрупп);
	СоздатьТовары(КоличествоЭлементов, МассивГрупп, КоличествоЭлементовВГруппе);
	Сообщить("Номенклатура успешно заполнена! Создано: " + Формат(КоличествоГрупп, "ЧГ=0") + " групп, " + Формат(КоличествоЭлементов, "ЧГ=0") + " товаров.");
КонецПроцедуры

Процедура ОчиститьНоменклатуру()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		Объект = ВыборкаДетальныхЗаписей.Ссылка.ПолучитьОбъект();
		Попытка
			Объект.Удалить();
		Исключение
			Объект.УстановитьПометкуУдаления(Истина);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция СоздатьГруппыНоменклатуры(КоличествоГрупп)
	ШаблоныНазванийГрупп = Новый Массив;
	ШаблоныНазванийГрупп.Добавить("Электроника");
	ШаблоныНазванийГрупп.Добавить("Одежда");
	ШаблоныНазванийГрупп.Добавить("Продукты");
	ШаблоныНазванийГрупп.Добавить("Мебель");
	ШаблоныНазванийГрупп.Добавить("Книги");
	ШаблоныНазванийГрупп.Добавить("Спорт");
	ШаблоныНазванийГрупп.Добавить("Игрушки");
	ШаблоныНазванийГрупп.Добавить("Бытовая техника");
	ШаблоныНазванийГрупп.Добавить("Автотовары");
	ШаблоныНазванийГрупп.Добавить("Канцтовары");
	
	МассивГрупп = Новый Массив;
	
	Для Инд = 1 По КоличествоГрупп Цикл
		НовыйОбъект = Справочники.Номенклатура.СоздатьГруппу();
		
		Если Инд <= ШаблоныНазванийГрупп.Количество() Тогда
			НовыйОбъект.Наименование = ШаблоныНазванийГрупп[Инд - 1];
		Иначе
			НовыйОбъект.Наименование = "Группа " + Формат(Инд, "ЧЦ=3; ЧВН=; ЧГ=0");
		КонецЕсли;
		
		НовыйОбъект.Код = Формат(Инд, "ЧЦ=5; ЧВН=; ЧГ=");
		
		Попытка
			НовыйОбъект.Записать();
			МассивГрупп.Добавить(НовыйОбъект.Ссылка);
		Исключение
			Сообщить("Ошибка создания группы " + НовыйОбъект.Наименование + ": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Возврат МассивГрупп;
КонецФункции

Процедура СоздатьТовары(КоличествоЭлементов, МассивГрупп, КоличествоЭлементовВГруппе)
	Если МассивГрупп.Количество() = 0 Тогда
		Сообщить("Не найдено групп номенклатуры!");
		Возврат;
	КонецЕсли;
	
	ЕдиницыИзмерения = Новый Массив;
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.шт);
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.кг);
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.л);
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.м);
	
	СтавкиНДС = Новый Массив;
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.БезНДС);
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС7);
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС0);
	
	НалоговыеГруппы = ПолучитьНалоговыеГруппы();
	
	ТекущаяГруппа = 0;
	ЭлементовВТекущейГруппе = 0;
	
	Для НомерТовара = 1 По КоличествоЭлементов Цикл
		НовыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		
		// Распределение по группам согласно КоличествоЭлементовВГруппе
		Если ЭлементовВТекущейГруппе >= КоличествоЭлементовВГруппе Тогда
			ТекущаяГруппа = ТекущаяГруппа + 1;
			ЭлементовВТекущейГруппе = 0;
			
			// Если закончились группы, начинаем сначала
			Если ТекущаяГруппа >= МассивГрупп.Количество() Тогда
				ТекущаяГруппа = 0;
			КонецЕсли;
		КонецЕсли;
		
		НовыйОбъект.Родитель = МассивГрупп[ТекущаяГруппа];
		НовыйОбъект.Наименование = СформироватьНазваниеТовара(НомерТовара);
		ЭлементовВТекущейГруппе = ЭлементовВТекущейГруппе + 1;
		НовыйОбъект.Код = Формат(300 + НомерТовара, "ЧЦ=5; ЧВН=; ЧГ=");
		НовыйОбъект.Артикул = "ART" + Формат(НомерТовара, "ЧЦ=6; ЧВН=; ЧГ=0");
		НовыйОбъект.ЕдиницаИзмерения = ЕдиницыИзмерения[(НомерТовара - 1) % ЕдиницыИзмерения.Количество()];
		НовыйОбъект.СтавкаНДС = СтавкиНДС[(НомерТовара - 1) % СтавкиНДС.Количество()];
		
		Если НалоговыеГруппы.Количество() > 0 Тогда
			НовыйОбъект.НалоговаяГруппа = НалоговыеГруппы[(НомерТовара - 1) % НалоговыеГруппы.Количество()];
		КонецЕсли;
		
		НовыйОбъект.КодУКТЗЕД = Формат(1234567890 + НомерТовара, "ЧЦ=10; ЧВН=; ЧГ=");
		НовыйОбъект.ТребуетАкцизнуюМарку = (НомерТовара % 10 = 0);
		НовыйОбъект.ПроцентНаценки = 10 + (НомерТовара % 50);
		
		Попытка
			НовыйОбъект.Записать();
		Исключение
			Сообщить("Ошибка создания товара №" + НомерТовара + ": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьНалоговыеГруппы()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговыеГруппы.Ссылка
		|ИЗ
		|	Справочник.НалоговыеГруппы КАК НалоговыеГруппы
		|ГДЕ
		|	НЕ НалоговыеГруппы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаГрупп = РезультатЗапроса.Выбрать();
	
	МассивГрупп = Новый Массив;
	Пока ВыборкаГрупп.Следующий() Цикл
		МассивГрупп.Добавить(ВыборкаГрупп.Ссылка);
	КонецЦикла;
	
	Возврат МассивГрупп;
КонецФункции

Функция СформироватьНазваниеТовара(НомерТовара)
	ТипыТоваров = Новый Массив;
	ТипыТоваров.Добавить("Товар");
	ТипыТоваров.Добавить("Изделие");
	ТипыТоваров.Добавить("Продукт");
	ТипыТоваров.Добавить("Устройство");
	ТипыТоваров.Добавить("Компонент");
	
	НазванияТоваров = Новый Массив;
	НазванияТоваров.Добавить("Стандартный");
	НазванияТоваров.Добавить("Премиум");
	НазванияТоваров.Добавить("Эконом");
	НазванияТоваров.Добавить("Профессиональный");
	НазванияТоваров.Добавить("Универсальный");
	
	ТипТовара = ТипыТоваров[(НомерТовара - 1) % ТипыТоваров.Количество()];
	НазваниеТовара = НазванияТоваров[(НомерТовара - 1) % НазванияТоваров.Количество()];
	
	Возврат ТипТовара + " " + НазваниеТовара + " №" + Формат(НомерТовара, "ЧЦ=3; ЧВН=; ЧГ=0");
КонецФункции

#КонецОбласти

#Область НастройкаКасс

Процедура СоздатьКассы() Экспорт
	
	// Проверяем наличие касс
	КоличествоКасс = ПолучитьКоличествоКасс();
	
	Если КоличествоКасс >= 2 Тогда
		Сообщить("Кассы уже созданы. Количество: " + КоличествоКасс);
		Возврат;
	КонецЕсли;
	
	// Очищаем существующие кассы (если есть)
	ОчиститьКассы();
	
	// Создаем 2 кассы
	Касса1 = СоздатьКассу("Касса №1", "001");
	Касса2 = СоздатьКассу("Касса №2", "002");
	
	Если Касса1 <> Неопределено И Касса2 <> Неопределено Тогда
		Сообщить("Кассы успешно созданы!");
	Иначе
		Сообщить("Ошибка при создании касс!");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКоличествоКасс()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Кассы.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	НЕ Кассы.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции

Процедура ОчиститьКассы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кассы.Ссылка КАК Касса
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	НЕ Кассы.Предопределенный";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			КассаОбъект = Выборка.Касса.ПолучитьОбъект();
			КассаОбъект.Удалить();
		Исключение
			Сообщить("Ошибка удаления кассы: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьКассу(Наименование, Код)
	
	Попытка
		НоваяКасса = Справочники.Кассы.СоздатьЭлемент();
		НоваяКасса.Наименование = Наименование;
		НоваяКасса.Код = Код;
		НоваяКасса.Записать();
		
		Возврат НоваяКасса.Ссылка;
	Исключение
		Сообщить("Ошибка создания кассы '" + Наименование + "': " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеЦен

Процедура ЗаполнитьЦены() Экспорт
	
	// Получаем или создаём типы цен
	ТипЗакупочная = ПолучитьИлиСоздатьТипЦен("Закупочная");
	ТипРозничная = ПолучитьИлиСоздатьТипЦен("Розничная");
	
	// Заполняем закупочные цены
	Если ТипЗакупочная <> Неопределено Тогда
		ЗаполнитьЦеныПоТипу(ТипЗакупочная, 50, 500);
	КонецЕсли;
	
	// Заполняем розничные цены
	Если ТипРозничная <> Неопределено Тогда
		ЗаполнитьЦеныПоТипу(ТипРозничная, 100, 1500);
	КонецЕсли;
	
	// Если есть другие типы цен - заполняем их тоже
	ДругиеТипыЦен = ПолучитьДругиеТипыЦен(ТипЗакупочная, ТипРозничная);
	Для Каждого ТипЦены Из ДругиеТипыЦен Цикл
		ЗаполнитьЦеныПоТипу(ТипЦены, 80, 1200);
	КонецЦикла;
	
	Сообщить("Заполнение цен завершено!");
	
КонецПроцедуры

// Получает существующий или создаёт новый тип цен
//
// Параметры:
//   Наименование - Строка - Наименование типа цен
//
// Возвращаемое значение:
//   СправочникСсылка.ТипыЦен, Неопределено - Найденный или созданный тип цен
//
Функция ПолучитьИлиСоздатьТипЦен(Наименование)
	
	// Ищем существующий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦен.Ссылка
		|ИЗ
		|	Справочник.ТипыЦен КАК ТипыЦен
		|ГДЕ
		|	ТипыЦен.Наименование = &Наименование
		|	И НЕ ТипыЦен.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// Создаём новый
	Попытка
		НовыйТип = Справочники.ТипыЦен.СоздатьЭлемент();
		НовыйТип.Наименование = Наименование;
		НовыйТип.Записать();
		Сообщить("Создан тип цен: " + Наименование);
		Возврат НовыйТип.Ссылка;
	Исключение
		Сообщить("Ошибка создания типа цен """ + Наименование + """: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Заполняет цены для конкретного типа цен
//
// Параметры:
//   ТипЦены - СправочникСсылка.ТипыЦен - Тип цен для заполнения
//   МинЦена - Число - Минимальная цена
//   МаксЦена - Число - Максимальная цена
//
Процедура ЗаполнитьЦеныПоТипу(ТипЦены, МинЦена, МаксЦена)
	
	// Получаем номенклатуру
	СписокНоменклатуры = ПолучитьНоменклатуру();
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Сообщить("Не найдено номенклатуры для заполнения цен!");
		Возврат;
	КонецЕсли;
	
	// Создаем документ Переоценка
	ДокументПереоценка = Документы.Переоценка.СоздатьДокумент();
	ДокументПереоценка.Дата = ТекущаяДата();
	ДокументПереоценка.ТипЦен = ТипЦены;
	
	КоличествоЦен = 0;
	
	// Заполняем табличную часть
	Для Каждого Номенклатура Из СписокНоменклатуры Цикл
		НоваяСтрока = ДокументПереоценка.Товары.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Цена = СлучайноеЧисло(МинЦена, МаксЦена);
		КоличествоЦен = КоличествоЦен + 1;
	КонецЦикла;
	
	Попытка
		ДокументПереоценка.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Заполнены цены типа """ + ТипЦены + """: " + КоличествоЦен + " позиций");
	Исключение
		Сообщить("Ошибка записи документа Переоценка для типа """ + ТипЦены + """: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Возвращает типы цен кроме указанных
//
// Параметры:
//   ИсключитьТип1 - СправочникСсылка.ТипыЦен, Неопределено - Первый тип для исключения
//   ИсключитьТип2 - СправочникСсылка.ТипыЦен, Неопределено - Второй тип для исключения
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.ТипыЦен - Другие типы цен
//
Функция ПолучитьДругиеТипыЦен(ИсключитьТип1 = Неопределено, ИсключитьТип2 = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЦен.Ссылка
		|ИЗ
		|	Справочник.ТипыЦен КАК ТипыЦен
		|ГДЕ
		|	НЕ ТипыЦен.ПометкаУдаления
		|	И ТипыЦен.Ссылка <> &Тип1
		|	И ТипыЦен.Ссылка <> &Тип2";
	
	Запрос.УстановитьПараметр("Тип1", ?(ИсключитьТип1 = Неопределено, Справочники.ТипыЦен.ПустаяСсылка(), ИсключитьТип1));
	Запрос.УстановитьПараметр("Тип2", ?(ИсключитьТип2 = Неопределено, Справочники.ТипыЦен.ПустаяСсылка(), ИсключитьТип2));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивТипов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивТипов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

Функция ПолучитьНоменклатуру()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивНоменклатуры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеШтрихкодов

Процедура ЗаполнитьШтрихкоды() Экспорт
	
	// Получаем номенклатуру
	СписокНоменклатуры = ПолучитьНоменклатуру();
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Сообщить("Не найдено номенклатуры для заполнения штрихкодов!");
		Возврат;
	КонецЕсли;
	
	// Заполняем штрихкоды
	КоличествоЗаполненных = 0;
	Счетчик = 1;
	
	Для Каждого Номенклатура Из СписокНоменклатуры Цикл
		МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Штрихкод = СформироватьШтрихкод(Счетчик);
		
		Попытка
			МенеджерЗаписи.Записать();
			КоличествоЗаполненных = КоличествоЗаполненных + 1;
		Исключение
			Сообщить("Ошибка записи штрихкода: " + ОписаниеОшибки());
		КонецПопытки;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Сообщить("Штрихкоды успешно заполнены! Записей: " + КоличествоЗаполненных);
	
КонецПроцедуры

Функция СформироватьШтрихкод(Номер)
	// Формируем штрихкод типа EAN-13 (13 цифр)
	Префикс = "200";
	НомерСтрока = Формат(Номер, "ЧЦ=9; ЧВН=; ЧГ=0");
	КодБезКонтрольнойЦифры = Префикс + НомерСтрока;
	
	// Вычисляем контрольную цифру
	Сумма = 0;
	Для Инд = 1 По СтрДлина(КодБезКонтрольнойЦифры) Цикл
		Цифра = Число(Сред(КодБезКонтрольнойЦифры, Инд, 1));
		Если Инд % 2 = 0 Тогда
			Сумма = Сумма + Цифра * 3;
		Иначе
			Сумма = Сумма + Цифра;
		КонецЕсли;
	КонецЦикла;
	
	КонтрольнаяЦифра = (10 - (Сумма % 10)) % 10;
	
	Возврат КодБезКонтрольнойЦифры + Формат(КонтрольнаяЦифра, "ЧЦ=1; ЧВН=; ЧГ=");
КонецФункции

#КонецОбласти

#Область ЗаполнениеОборудования

Процедура СоздатьОборудование() Экспорт
	
	// Очищаем существующее оборудование
	ОчиститьОборудование();
	
	// Получаем кассы
	Кассы = ПолучитьКассы();
	
	// Создаем сканер штрихкода
	СоздатьЕдиницуОборудования("Сканер штрихкода", "SCAN001", Перечисления.ТипыОборудования.СканерШтрихкода, "AddInNative.1CScan");
	
	// Создаем принтер чеков
	СоздатьЕдиницуОборудования("Принтер чеков", "PRINT001", Перечисления.ТипыОборудования.ПринтерЧеков, "AddInNative.Printer");
	
	// Создаем ККТ для каждой кассы и привязываем к кассе
	Счетчик = 1;
	Для Каждого Касса Из Кассы Цикл
		КодОборудования = "KKT" + Формат(Счетчик, "ЧЦ=3; ЧВН=; ЧГ=0");
		Наименование = "ККТ для " + Касса.Наименование;
		НовоеККТ = СоздатьЕдиницуОборудования(Наименование, КодОборудования, Перечисления.ТипыОборудования.ККТ, "AddInNative.FiscalPrinter");
		
		// Привязываем ККТ (РРО/ПРРО) непосредственно к кассе
		Если НовоеККТ <> Неопределено Тогда
			Попытка
				КассаОбъект = Касса.ПолучитьОбъект();
				КассаОбъект.Оборудование = НовоеККТ;
				КассаОбъект.Записать();
			Исключение
				Сообщить("Ошибка привязки ККТ к кассе: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Сообщить("Оборудование успешно создано! Создано: " + (2 + Кассы.Количество()) + " единиц. ККТ привязаны к кассам.");
	
КонецПроцедуры

Процедура ОчиститьОборудование()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовоеОборудование.Ссылка
		|ИЗ
		|	Справочник.КассовоеОборудование КАК КассовоеОборудование
		|ГДЕ
		|	НЕ КассовоеОборудование.Предопределенный";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			ОборудованиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ОборудованиеОбъект.Удалить();
		Исключение
			Сообщить("Ошибка удаления оборудования: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЕдиницуОборудования(Наименование, Код, ТипОборудования, ДрайверID)
	
	Попытка
		НовоеОборудование = Справочники.КассовоеОборудование.СоздатьЭлемент();
		НовоеОборудование.Наименование = Наименование;
		НовоеОборудование.Код = Код;
		НовоеОборудование.ТипОборудования = ТипОборудования;
		НовоеОборудование.ДрайверID = ДрайверID;
		НовоеОборудование.Записать();
		
		Возврат НовоеОборудование.Ссылка;
	Исключение
		Сообщить("Ошибка создания оборудования '" + Наименование + "': " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьКассы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кассы.Ссылка КАК Касса,
		|	Кассы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	НЕ Кассы.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивКасс = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивКасс.Добавить(Выборка.Касса);
	КонецЦикла;
	
	Возврат МассивКасс;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеНастроекРаспределения

Процедура ЗаполнитьНастройкиРаспределения() Экспорт
	
	// Получаем кассы
	Кассы = ПолучитьКассы();
	Если Кассы.Количество() = 0 Тогда
		Сообщить("Не найдено касс! Сначала создайте кассы.");
		Возврат;
	КонецЕсли;
	
	// Получаем ККТ оборудование
	ОборудованиеККТ = ПолучитьОборудованиеПоТипу(Перечисления.ТипыОборудования.ККТ);
	Если ОборудованиеККТ.Количество() = 0 Тогда
		Сообщить("Не найдено ККТ оборудования! Сначала создайте оборудование.");
		Возврат;
	КонецЕсли;
	
	// Привязываем ККТ непосредственно к кассам (1 касса = 1 РРО/ПРРО)
	КоличествоЗаписей = 0;
	ИндексОборудования = 0;
	
	Для Каждого Касса Из Кассы Цикл
		
		// Циклически назначаем оборудование
		Оборудование = ОборудованиеККТ[ИндексОборудования % ОборудованиеККТ.Количество()];
		
		Попытка
			КассаОбъект = Касса.ПолучитьОбъект();
			КассаОбъект.Оборудование = Оборудование;
			КассаОбъект.Записать();
			КоличествоЗаписей = КоличествоЗаписей + 1;
		Исключение
			Сообщить("Ошибка привязки ККТ к кассе: " + ОписаниеОшибки());
		КонецПопытки;
		
		ИндексОборудования = ИндексОборудования + 1;
	КонецЦикла;
	
	Сообщить("Оборудование привязано к кассам! Обновлено касс: " + КоличествоЗаписей);
	
КонецПроцедуры

Процедура ОчиститьНастройкиРаспределения()
	
	// Очищаем привязку оборудования в кассах
	Кассы = ПолучитьКассы();
	Для Каждого Касса Из Кассы Цикл
		Попытка
			КассаОбъект = Касса.ПолучитьОбъект();
			КассаОбъект.Оборудование = Справочники.КассовоеОборудование.ПустаяСсылка();
			КассаОбъект.Записать();
		Исключение
			Сообщить("Ошибка очистки привязки: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОборудованиеПоТипу(ТипОборудования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовоеОборудование.Ссылка
		|ИЗ
		|	Справочник.КассовоеОборудование КАК КассовоеОборудование
		|ГДЕ
		|	КассовоеОборудование.ТипОборудования = &ТипОборудования
		|	И НЕ КассовоеОборудование.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТипОборудования", ТипОборудования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивОборудования = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивОборудования.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивОборудования;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СлучайноеЧисло(Мин, Макс)
	Генератор = Новый ГенераторСлучайныхЧисел();
	Возврат Окр(Генератор.СлучайноеЧисло(Мин,Макс), 2);
КонецФункции

#КонецОбласти

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры
